printNumber(number) {
  print('number is $number');
}
main() {
  int number = 10;
  printNumber(number);
}
/*
  在变量中可以放置的所有东西都是对象，而每个对象都是类的实例。
  无论数字、函数和null都是对象。所有对象都继承自[Object]类。
  尽管Dart是强类型的，但类型声明是可选的，因为Dart可以推断类型。
  在上面的代码中，数字被推断为int类型。
  如果要明确说明不需要任何类型，请使用[特殊类型dynamic]。
  Dart支持通用类型，如List<int>(整数列表)或List<dynamic>(任何类型的对象列表)。
  Dart支持顶级函数(如main())，以及绑定到类或对象(分别是静态方法（static）和实例（instance）方法)的函数。您还可以在函数(嵌套或局部函数)中创建函数。
类似地，Dart支持顶级变量，以及绑定到类或对象(静态和实例变量)的变量。实例变量有时被称为字段或属性。
与Java不同，Dart没有公开、保护和私有的关键字。如果标识符以下划线(_)开头，则该标识符对其库是私有的。有关详细信息，请参见[库和可见性]。
标识符可以以字母或下划线(_)开头，然后是这些字符加上数字的任何组合。
有时候，某事物是一个表达（expression ）还是一个语句（statement）是很重要的，所以这两个词要准确。
Dart工具可以报告两种问题:警告和错误。警告只是表明您的代码可能不工作，但它们不会阻止您的程序执行。错误可以是编译时错误，也可以是运行时错误。编译时错误阻止了代码的执行;运行时错误导致代码执行时引发异常。
 */